Tekla.Structures.Catalogs.UserPropertyItem
The UserPropertyItem class contains information about the user properties in the Tekla Structures catalog.

Tekla.Structures.Catalogs.UserPropertyItem.#ctor
Creates a new user property item instance.

Tekla.Structures.Catalogs.UserPropertyItem.Name
The name of the user property.

Tekla.Structures.Catalogs.UserPropertyItem.Type
The type of the user property.

Tekla.Structures.Catalogs.UserPropertyItem.FieldType
The field type of the user property.

Tekla.Structures.Catalogs.UserPropertyItem.Level
The level at which the user property has been defined.

Tekla.Structures.Catalogs.UserPropertyItem.AffectsNumbering
Indicates whether the property value affects the numbering of objects.

Tekla.Structures.Catalogs.UserPropertyItem.Unique
Indicates whether the property value is copied when the object is copied.

Tekla.Structures.Catalogs.UserPropertyItem.Visibility
Indicates whether the property value is visible/editable.

Tekla.Structures.Catalogs.UserPropertyItem.GetDefaultValue(System.Int32@)
Gets the default value of an integer property.
DefaultValue: The value that was gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetDefaultValue(System.Int32)
Sets the default value of an integer property.
DefaultValue: The new value.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetDefaultValue(System.Double@)
Gets the default value of a double property.
DefaultValue: The value that was gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetDefaultValue(System.Double)
Sets the default value of a double property.
DefaultValue: The new value.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetDefaultValue(System.String@)
Gets the default value of a string property.
DefaultValue: The value that was gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetDefaultValue(System.String)
Sets the default value of a string property.
DefaultValue: The new value.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}}@)
Gets the value options of an integer property. Option strings are translated when translation is available.
IntOptions: The value options.
Returns:
True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}}@,System.Boolean)
Gets the value options of an integer property.
IntOptions: The value options.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns:
True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}})
Sets the value options of an integer property.
The maximum count of options is 400.
IntOptions: The value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}}@)
Gets the value options of a double property. Option strings are translated when translation is available.
DoubleOptions: The value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}}@,System.Boolean)
Gets the value options of a double property.
DoubleOptions: The value options.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}})
Sets the value options of a double property.
The maximum count of options is 400.
DoubleOptions: The value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}}@)
Gets the value options of a string property. Option strings are translated when translation is available.
StringOptions: The value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}}@,System.Boolean)
Gets the value options of a string property.
StringOptions: The value options.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})
Sets the value options of a string property.
The maximum count of options is 400.
StringOptions: The new value options.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SetLabel(System.String)
Sets the label of the user property.
label: The new label.

Tekla.Structures.Catalogs.UserPropertyItem.GetLabel
Gets the label of the user property. Labels are translated when translation is available.
Returns: The label of the user property.

Tekla.Structures.Catalogs.UserPropertyItem.GetLabel(System.Boolean)
Gets the label of the user property.
translated: if set to true translated text is returned.
Returns:
The label of the user property.

Tekla.Structures.Catalogs.UserPropertyItem.Insert
Inserts the user property item to the database.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.Modify
Modifies the user property item.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.Delete
Deletes the user property item from the database.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.Select
Selects by name the user property item from the database.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetObjectTypes(System.Collections.Generic.List{Tekla.Structures.Catalogs.CatalogObjectTypeEnum}@)
Gets the object types which contain this user property item.
objectTypes: The object types that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.AddToObjectType(Tekla.Structures.Catalogs.CatalogObjectTypeEnum)
Adds the user property item to the given object type.
objectType: The object type to add the item to.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.RemoveFromObjectType(Tekla.Structures.Catalogs.CatalogObjectTypeEnum)
Removes the user property item from the given object type.
objectType: The object type to remove the item from.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.InsertProperty
Inserts user property item to the database.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.ModifyProperty
Modifies user property item.
Only model level properties can be modified.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.DeleteProperty
Deletes the user property item from the database.
Only model level properties can be deleted.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.SelectProperty
Selects the user property item from the database by name.
Returns: True on success.